unsupervised_learning/documentation.org
#+TITLE: Unsupervised Learning
#+AUTHOR: Tooraj Taraz
#+DATE: Mon Oct 25 18:13:34 2021
#+OPTIONS: ^:nil _:nil
#+SETUPFILE: ~/.doom.d/retro-dark.theme
* K-MEANS
** How does it work?
K-Means algorithm initially picks K points randomly and starts forming clusters based on distance (assigning points to closest seed). Each iteration improves the overall quality of clusters and we stop when no change has occurred between two iteration.
** Loading dataset and needed libraries
Before we begin we need to import needed libraries which implement K-Means clustering algorithm, I've used two different implementation, One that utilizes CPU and one that utilizes GPU.
#+BEGIN_SRC python
from util import _x, _y_int #uses a few lines of code to load mnist dataset
from sklearn.cluster import MiniBatchKMeans #CPU accelerated kmeans
from sklearn.metrics import accuracy_score, adjusted_rand_score #to run metrics
import numpy as np #to work with numbers :))
from fast_pytorch_kmeans import KMeans #GPU accelerated kmeans
import torch #GPU accelerated kmeans
from tabulate import tabulate #for pretty output
#+END_SRC
Some of these libraries are going to be used for other algorithms as well, to avoid repetion I'll put comment for them only once.
Here is my util script (the loader function is not my implementation, I found it in an closed issue on Github, but I have modified it a little)
#+BEGIN_SRC python
import gzip
import os
from urllib.request import urlretrieve
import numpy as np
import matplotlib.pyplot as plt


def mnist(path=None):
    r"""Return (train_images, train_labels, test_images, test_labels).

    Args:
        path (str): Directory containing MNIST. Default is
            /home/USER/data/mnist or C:\Users\USER\data\mnist.
            Create if nonexistant. Download any missing files.

    Returns:
        Tuple of (train_images, train_labels, test_images, test_labels), each
            a matrix. Rows are examples. Columns of images are pixel values.
            Columns of labels are a onehot encoding of the correct class.
    """
    url = 'http://yann.lecun.com/exdb/mnist/'
    files = ['train-images-idx3-ubyte.gz',
             'train-labels-idx1-ubyte.gz',
             't10k-images-idx3-ubyte.gz',
             't10k-labels-idx1-ubyte.gz']

    if path is None:
        # Set path to /home/USER/data/mnist or C:\Users\USER\data\mnist
        path = os.path.join(os.path.expanduser('~'), 'data', 'mnist')

    # Create path if it doesn't exist
    os.makedirs(path, exist_ok=True)

    # Download any missing files
    for file in files:
        if file not in os.listdir(path):
            urlretrieve(url + file, os.path.join(path, file))
            print("Downloaded %s to %s" % (file, path))

    def _images(path):
        """Return images loaded locally."""
        with gzip.open(path) as f:
            # First 16 bytes are magic_number, n_imgs, n_rows, n_cols
            pixels = np.frombuffer(f.read(), 'B', offset=16)
        return pixels.reshape(-1, 784).astype('float32') / 255

    def _labels(path):
        """Return labels loaded locally."""
        with gzip.open(path) as f:
            # First 8 bytes are magic_number, n_labels
            integer_labels = np.frombuffer(f.read(), 'B', offset=8)

        def _onehot(integer_labels):
            """Return matrix whose rows are onehot encodings of integers."""
            n_rows = len(integer_labels)
            n_cols = integer_labels.max() + 1
            onehot = np.zeros((n_rows, n_cols), dtype='uint8')
            onehot[np.arange(n_rows), integer_labels] = 1
            return onehot

        return _onehot(integer_labels), integer_labels

    train_images = _images(os.path.join(path, files[0]))
    train_labels, train_int_labels = _labels(os.path.join(path, files[1]))
    test_images = _images(os.path.join(path, files[2]))
    test_labels, test_int_labels = _labels(os.path.join(path, files[3]))

    return train_images, train_labels, test_images, test_labels, train_int_labels, test_int_labels
#importing dataset
_x, _y, _a, _b, _y_int, _b_int= mnist('/path/to/desired/folder')

#printing loaded data info
print(_y)
print(_x)
#used for plotting hand written numbers from dataset
def plot_some():
    num = 20
    images = _x[:num]
    labels = _y[:num]

    num_row = 4
    num_col = 5
    fig, axes = plt.subplots(num_row, num_col, figsize=(1.5*num_col,2*num_row))
    for i in range(num):
        ax = axes[i//num_col, i%num_col]
        ax.imshow(images[i].reshape(28,28), cmap='gray')
        ax.set_title('Label: {}'.format(labels[i]))
    plt.tight_layout()
    plt.show()
#+END_SRC
** Extracting labels (classifying clusters)
When K-Means's execution is over we have K clusters, first we need to find out which number has occured the most in each cluster and represent that cluster with that number. Let's say one cluster includes 1, 1, 1, 1, 2, 7, 7, 1 in this case we consider this cluster, 1. "classify_clusters" handles what I just explained:
#+BEGIN_SRC python
def classify_clusters(l1, l2):
    ref_labels = {}
    for i in range(len(np.unique(l1))):
        index = np.where(l1 == i,1,0)
        ref_labels[i] = np.bincount(l2[index==1]).argmax()
    decimal_labels = np.zeros(len(l1))
    for i in range(len(l1)):
        decimal_labels[i] = ref_labels[l1[i]]
    return decimal_labels
#+END_SRC

l1 is array of each cluster's label (kmeans_main.labels_), and l2 is array of actual labels.
It's note worthy that there are two global variables in my script:
1. kmeans_main
2. cluster_ids_x

They are populated by init_clustring_* function and they contain an object containing labels!
These functions init_clustrng_* don't need much elaboration, they just call kmean constructor in each library and populate global variables.

#+BEGIN_SRC python
def init_clustring_scikit(cluster_count=10):
    global kmeans_main
    kmeans_main = MiniBatchKMeans(n_clusters=cluster_count, verbose=False)
    kmeans_main.fit(_x)

def init_clustring_torch(cluster_count=10):
    global clusters_from_label, cluster_ids_x
    _kmeans = KMeans(n_clusters=cluster_count, mode='euclidean', verbose=1)
    x = torch.from_numpy(_x)
    cluster_ids_x = _kmeans.fit_predict(x)
#+END_SRC
