unsupervised_learning/documentation.org
** Evaluation
At last we have test_accuracy_* functions, they are responsible for calculating and printing purity and random index scores.

#+BEGIN_SRC python
def test_accuracy_scikit():
    global kmeans_main
    decimal_labels = classify_clusters(kmeans_main.labels_, _y_int)
    print("predicted labels:\t", decimal_labels[:16].astype('int'))
    print("true labels:\t\t",_y_int[:16])
    print(60 * '_')
    AP = accuracy_score(decimal_labels,_y_int)
    RI = adjusted_rand_score(decimal_labels,_y_int)
    print("Accuracy (PURITY):" , AP)
    print("Accuracy (RAND INDEX):" , RI)
    return AP, RI

def test_accuracy_torch():
    global cluster_ids_x
    decimal_labels = classify_clusters(cluster_ids_x.cpu().detach().numpy(), _y_int)
    print("predicted labels:\t", decimal_labels[:16].astype('int'))
    print("true labels:\t\t",_y_int[:16])
    print(60 * '_')
    AP = accuracy_score(decimal_labels,_y_int)
    RI = adjusted_rand_score(decimal_labels,_y_int)
    print("Accuracy (PURITY):" , AP)
    print("Accuracy (RAND INDEX):" , RI)
    return AP, RI
#+END_SRC

Finally combination of these functions are called in pipeline function.
#+BEGIN_SRC python
def pipeline(lib="torch", cluster_count_max=300, coefficient=2):
    cluster_count = len(np.unique(_y_int))
    result = []
    if lib == "torch":
        while cluster_count <= cluster_count_max:
            print(10 * "*" + "TRYING WITH " + str(cluster_count) + 10 * "*")
            init_clustring_torch(cluster_count)
            AP, RI = test_accuracy_torch()
            result.append([cluster_count, AP, RI])
            cluster_count *= coefficient
            cluster_count = int(cluster_count)
    elif lib == "scikit":
        while cluster_count <= cluster_count_max:
            print(10 * "*" + "TRYING WITH " + str(cluster_count) + 10 * "*")
            init_clustring_scikit(cluster_count)
            AP, RI = test_accuracy_scikit()
            result.append([cluster_count, AP, RI])
            cluster_count *= coefficient
            cluster_count = int(cluster_count)
    else:
        print("LIB NOT SUPPORTED")

    print(tabulate(result, headers=['K', 'AP', 'RI']))
#+END_SRC
** Result
In K-Means there isn't much to play with, the only variable that we can play with is K, and as it is expected the more clusters we have the more accurate desions are made by the algorithm. Of course by increasing K we will have multiple clusters representing one number but I think up to a point it can be tolerated. There is a table representing relation between K value and scores:
+-----+--------+--------+
|  K  | AP     | RI     |
+-----+--------+--------+
| 10  |0.597183|0.413258|
+-----+--------+--------+
| 12  |0.604917|0.430174|
+-----+--------+--------+
| 14  |0.65535 |0.472108|
+-----+--------+--------+
| 16  |0.680167|0.505252|
+-----+--------+--------+
| 19  |0.703983|0.529956|
+-----+--------+--------+
| 22  | 0.7115 |0.543603|
+-----+--------+--------+
| 26  |0.732617|0.552085|
+-----+--------+--------+
| 31  | 0.7495 |0.587359|
+-----+--------+--------+
| 37  |0.787217|0.62724 |
+-----+--------+--------+
| 44  | 0.8023 |0.651268|
+-----+--------+--------+
| 52  |0.82465 |0.676564|
+-----+--------+--------+
| 62  | 0.8436 |0.702975|
+-----+--------+--------+
| 74  |0.852117|0.721181|
+-----+--------+--------+
| 88  |0.865433|0.741598|
+-----+--------+--------+
| 105 |0.87975 |0.76377 |
+-----+--------+--------+
| 126 |0.880133|0.764852|
+-----+--------+--------+
| 151 |0.888583|0.780502|
+-----+--------+--------+
| 181 |0.896067|0.790999|
+-----+--------+--------+

As it was expected accuracy increases along side K!
* MeanShift
Libraries used for running this algorithm are almost identical to what we saw in K-Means script, the only difference is the algorithm itself.
** How does it work?
This algorithm tries to find density! It actually tries to seek the maxima of a density function. There are a few kernels for calculating weight of nearby point such as flat and Gaussian.
Flat kernel is really simple, if the point is within a specific range, the result will be 1 otherwise 0.
Gaussian kernel uses and exponential equation for weighting, scikit uses a flat kernel in its implementation.
There is one catch to this algorithm that being limitation on the sample size, as it has complexity of O(T*n^2)-based on scikit doc-. On sample sizes greater than 10K it'll cause some problems, like taking to long to generate results, that's what I experienced while working on mnist dataset that's why I'm executing this script on a random mnist subset.
** Libraries
#+BEGIN_SRC python  :session :results value
from sklearn.cluster import MeanShift, estimate_bandwidth
from sklearn.metrics import accuracy_score, adjusted_rand_score
from tabulate import tabulate
from util import _x, _y_int
import math
import numpy as np
import random as rand
#+END_SRC

