unsupervised_learning/documentation.md


<a id="org0ad262e"></a>

## Evaluation

At last we have test\_accuracy\_\* functions, they are responsible for calculating and printing purity and random index scores.

    def test_accuracy_scikit():
        global kmeans_main
        decimal_labels = classify_clusters(kmeans_main.labels_, _y_int)
        print("predicted labels:\t", decimal_labels[:16].astype('int'))
        print("true labels:\t\t",_y_int[:16])
        print(60 * '_')
        AP = accuracy_score(decimal_labels,_y_int)
        RI = adjusted_rand_score(decimal_labels,_y_int)
        print("Accuracy (PURITY):" , AP)
        print("Accuracy (RAND INDEX):" , RI)
        return AP, RI
    
    def test_accuracy_torch():
        global cluster_ids_x
        decimal_labels = classify_clusters(cluster_ids_x.cpu().detach().numpy(), _y_int)
        print("predicted labels:\t", decimal_labels[:16].astype('int'))
        print("true labels:\t\t",_y_int[:16])
        print(60 * '_')
        AP = accuracy_score(decimal_labels,_y_int)
        RI = adjusted_rand_score(decimal_labels,_y_int)
        print("Accuracy (PURITY):" , AP)
        print("Accuracy (RAND INDEX):" , RI)
        return AP, RI

Finally combination of these functions are called in pipeline function.

    def pipeline(lib="torch", cluster_count_max=300, coefficient=2):
        cluster_count = len(np.unique(_y_int))
        result = []
        if lib == "torch":
            while cluster_count <= cluster_count_max:
                print(10 * "*" + "TRYING WITH " + str(cluster_count) + 10 * "*")
                init_clustring_torch(cluster_count)
                AP, RI = test_accuracy_torch()
                result.append([cluster_count, AP, RI])
                cluster_count *= coefficient
                cluster_count = int(cluster_count)
        elif lib == "scikit":
            while cluster_count <= cluster_count_max:
                print(10 * "*" + "TRYING WITH " + str(cluster_count) + 10 * "*")
                init_clustring_scikit(cluster_count)
                AP, RI = test_accuracy_scikit()
                result.append([cluster_count, AP, RI])
                cluster_count *= coefficient
                cluster_count = int(cluster_count)
        else:
            print("LIB NOT SUPPORTED")
    
        print(tabulate(result, headers=['K', 'AP', 'RI']))


<a id="orgd41c032"></a>

## Result

In K-Means there isn&rsquo;t much to play with, the only variable that we can play with is K, and as it is expected the more clusters we have the more accurate desions are made by the algorithm. Of course by increasing K we will have multiple clusters representing one number but I think up to a point it can be tolerated. There is a table representing relation between K value and scores:

<!-- This HTML table template is generated by emacs 27.2 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;K&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;AP&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;RI&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;10&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      0.597183
    </td>
    <td align="left" valign="top">
      0.413258
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;12&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      0.604917
    </td>
    <td align="left" valign="top">
      0.430174
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;14&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      0.65535&nbsp;
    </td>
    <td align="left" valign="top">
      0.472108
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;16&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      0.680167
    </td>
    <td align="left" valign="top">
      0.505252
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;19&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      0.703983
    </td>
    <td align="left" valign="top">
      0.529956
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;22&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.7115&nbsp;
    </td>
    <td align="left" valign="top">
      0.543603
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;26&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      0.732617
    </td>
    <td align="left" valign="top">
      0.552085
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;31&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.7495&nbsp;
    </td>
    <td align="left" valign="top">
      0.587359
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;37&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      0.787217
    </td>
    <td align="left" valign="top">
      0.62724&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;44&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.8023&nbsp;
    </td>
    <td align="left" valign="top">
      0.651268
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;52&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      0.82465&nbsp;
    </td>
    <td align="left" valign="top">
      0.676564
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;62&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.8436&nbsp;
    </td>
    <td align="left" valign="top">
      0.702975
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;74&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      0.852117
    </td>
    <td align="left" valign="top">
      0.721181
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;88&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      0.865433
    </td>
    <td align="left" valign="top">
      0.741598
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;105&nbsp;
    </td>
    <td align="left" valign="top">
      0.87975&nbsp;
    </td>
    <td align="left" valign="top">
      0.76377&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;126&nbsp;
    </td>
    <td align="left" valign="top">
      0.880133
    </td>
    <td align="left" valign="top">
      0.764852
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;151&nbsp;
    </td>
    <td align="left" valign="top">
      0.888583
    </td>
    <td align="left" valign="top">
      0.780502
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;181&nbsp;
    </td>
    <td align="left" valign="top">
      0.896067
    </td>
    <td align="left" valign="top">
      0.790999
    </td>
  </tr>
</table>

As it was expected accuracy increases along side K!


<a id="org7f58237"></a>

# MeanShift

Libraries used for running this algorithm are almost identical to what we saw in K-Means script, the only difference is the algorithm itself.


<a id="orgc58c83c"></a>

## How does it work?

This algorithm tries to find density! It actually tries to seek the maxima of a density function. There are a few kernels for calculating weight of nearby point such as flat and Gaussian.
Flat kernel is really simple, if the point is within a specific range, the result will be 1 otherwise 0.
Gaussian kernel uses and exponential equation for weighting, scikit uses a flat kernel in its implementation.
There is one catch to this algorithm that being limitation on the sample size, as it has complexity of O(T\*n^2)-based on scikit doc-. On sample sizes greater than 10K it&rsquo;ll cause some problems, like taking to long to generate results, that&rsquo;s what I experienced while working on mnist dataset that&rsquo;s why I&rsquo;m executing this script on a random mnist subset.


<a id="org4a3c0b5"></a>

## Libraries

    from sklearn.cluster import MeanShift, estimate_bandwidth
    from sklearn.metrics import accuracy_score, adjusted_rand_score
    from tabulate import tabulate
    from util import _x, _y_int
    import math
    import numpy as np
    import random as rand
