unsupervised_learning/documentation.org
** Extracting labels and evaluation
The procedure is the same as what we saw in K-Means script, we classify clusters and extract their label, and then we use a pipeline function to run the algorithm multiple times with different variables.
There are 3 function responsible for running and metering the algorithm:
1. classify_clusters : finds the number that has with highest repetition in each cluster
2. init_clustring_scikit : slices the loaded dataset and executes the algorithm
3. test_accuracy_scikit : runs metrics on the results

#+BEGIN_SRC  python
def classify_clusters(l1, l2):
    ref_labels = {}
    for i in range(len(np.unique(l1))):
        index = np.where(l1 == i,1,0)
        temp = np.bincount(l2[index==1]).argmax()
        ref_labels[i] = temp
    decimal_labels = np.zeros(len(l1))
    for i in range(len(l1)):
        decimal_labels[i] = ref_labels[l1[i]]
    return decimal_labels

def init_clustring_scikit(bandwidth=2, slice_size=6000):
    global clustering
    indexes = np.random.choice(len(_x), size=slice_size, replace=False)
    clustering = MeanShift(bandwidth=bandwidth, n_jobs=12)
    clustering.fit(_x[indexes])
    return _y_int[indexes]

def test_accuracy_scikit(labels):
    global clustering
    decimal_labels = classify_clusters(clustering.labels_, labels)
    print("NUMBER OF CLUSTERS:", len(np.unique(clustering.labels_)))
    print("predicted labels:\t", decimal_labels[:16].astype('int'))
    print("true labels:\t\t", labels[:16])
    print(60 * '_')
    AP = accuracy_score(decimal_labels,labels)
    RI = adjusted_rand_score(decimal_labels,labels)
    print("Accuracy (PURITY):" , AP)
    print("Accuracy (RAND INDEX):" , RI)
    return AP, RI, len(np.unique(clustering.labels_))
#+END_SRC


** Results
As we run the algorithm with multiple bandwidths on slice of size 6000 in the pipeline we get interesting results. Here is pipeline function:

#+BEGIN_SRC python
def pipeline(bandwidth_max=100, coefficient=2):
    bandwidth = 2
    result = []
    AP = None
    RI = None
    while bandwidth <= bandwidth_max:
        print(10 * "*" + "TRYING WITH " + str(bandwidth) + 10 * "*")
        labels = iO(T*n^2)nit_clustring_scikit(bandwidth)
        AP, RI, n= test_accuracy_scikit(labels)
        result.append([bandwidth, AP, RI, n])
        bandwidth *= coefficient
        bandwidth = math.ceil(bandwidth)
    print(tabulate(result, headers=['BandWidth', 'AP', 'RI', 'Cluster Count']))
#+END_SRC

When bandwidth is too small the algorithm starts to detecting too many clusters and as a result the accuracy is close or equal to 100%, and when bandwidth starts growing -larger than the appropriate bandwidth- the algorithm starts putting everything in a single cluster and as a result awful accuracy.
Here is a table showing relation between BandWidth and purity, random index and number of clusters:

+---------+--------+---------+------------+
|BandWidth| AP     | RI      |ClusterCount|
+---------+--------+---------+------------+
|    2    |  1     |  1      |    5770    |
+---------+--------+---------+------------+
|    3    |0.9995  |0.998818 |    5416    |
+---------+--------+---------+------------+
|    4    |0.995167|0.988411 |    4767    |
+---------+--------+---------+------------+
|    5    | 0.9385 |0.877167 |    3032    |
+---------+--------+---------+------------+
|    6    |0.759333|0.516909 |    1178    |
+---------+--------+---------+------------+
|    8    |0.150667|0.0041183|     29     |
+---------+--------+---------+------------+
|   10    |0.115333|    0    |     1      |
+---------+--------+---------+------------+
|   12    |0.109667|    0    |     1      |
+---------+--------+---------+------------+
|   15    | 0.118  |    0    |     1      |
+---------+--------+---------+------------+
|   18    |0.113333|    0    |     1      |
+---------+--------+---------+------------+
|   22    | 0.113  |    0    |     1      |
+---------+--------+---------+------------+
|   27    |0.115833|    0    |     1      |
+---------+--------+---------+------------+
|   33    |0.109833|    0    |     1      |
+---------+--------+---------+------------+
|   40    | 0.113  |    0    |     1      |
+---------+--------+---------+------------+
|   48    |0.111167|    0    |     1      |
+---------+--------+---------+------------+
|   58    | 0.1105 |    0    |     1      |
+---------+--------+---------+------------+
|   70    |0.114667|    0    |     1      |
+---------+--------+---------+------------+
|   84    |0.114167|    0    |     1      |
+---------+--------+---------+------------+
* DBSCAN
** How does it work?
There are two parameters in this algorithm, epsilon and min-samples. epsilon is the maximum distance from a cluster center and min sample is the minimum number of points required for a cluster to form. After cluster creation each point in every cluster starts its own circle and starts looking for other points to form a cluster.

As functions and what they do is really similar to what we already had, I'll only explain things that differ.
