unsupervised_learning/documentation.md


<a id="orgd1f6e21"></a>

## Extracting labels and evaluation

The procedure is the same as what we saw in K-Means script, we classify clusters and extract their label, and then we use a pipeline function to run the algorithm multiple times with different variables.
There are 3 function responsible for running and metering the algorithm:

1.  classify\_clusters : finds the number that has with highest repetition in each cluster
2.  init\_clustring\_scikit : slices the loaded dataset and executes the algorithm
3.  test\_accuracy\_scikit : runs metrics on the results

    def classify_clusters(l1, l2):
        ref_labels = {}
        for i in range(len(np.unique(l1))):
            index = np.where(l1 == i,1,0)
            temp = np.bincount(l2[index==1]).argmax()
            ref_labels[i] = temp
        decimal_labels = np.zeros(len(l1))
        for i in range(len(l1)):
            decimal_labels[i] = ref_labels[l1[i]]
        return decimal_labels
    
    def init_clustring_scikit(bandwidth=2, slice_size=6000):
        global clustering
        indexes = np.random.choice(len(_x), size=slice_size, replace=False)
        clustering = MeanShift(bandwidth=bandwidth, n_jobs=12)
        clustering.fit(_x[indexes])
        return _y_int[indexes]
    
    def test_accuracy_scikit(labels):
        global clustering
        decimal_labels = classify_clusters(clustering.labels_, labels)
        print("NUMBER OF CLUSTERS:", len(np.unique(clustering.labels_)))
        print("predicted labels:\t", decimal_labels[:16].astype('int'))
        print("true labels:\t\t", labels[:16])
        print(60 * '_')
        AP = accuracy_score(decimal_labels,labels)
        RI = adjusted_rand_score(decimal_labels,labels)
        print("Accuracy (PURITY):" , AP)
        print("Accuracy (RAND INDEX):" , RI)
        return AP, RI, len(np.unique(clustering.labels_))


<a id="orgffe8436"></a>

## Results

As we run the algorithm with multiple bandwidths on slice of size 6000 in the pipeline we get interesting results. Here is pipeline function:

    def pipeline(bandwidth_max=100, coefficient=2):
        bandwidth = 2
        result = []
        AP = None
        RI = None
        while bandwidth <= bandwidth_max:
            print(10 * "*" + "TRYING WITH " + str(bandwidth) + 10 * "*")
            labels = iO(T*n^2)nit_clustring_scikit(bandwidth)
            AP, RI, n= test_accuracy_scikit(labels)
            result.append([bandwidth, AP, RI, n])
            bandwidth *= coefficient
            bandwidth = math.ceil(bandwidth)
        print(tabulate(result, headers=['BandWidth', 'AP', 'RI', 'Cluster Count']))

When bandwidth is too small the algorithm starts to detecting too many clusters and as a result the accuracy is close or equal to 100%, and when bandwidth starts growing -larger than the appropriate bandwidth- the algorithm starts putting everything in a single cluster and as a result awful accuracy.
Here is a table showing relation between BandWidth and purity, random index and number of clusters:

<!-- This HTML table template is generated by emacs 27.2 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      BandWidth
    </td>
    <td align="left" valign="top">
      &nbsp;AP&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;RI&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      ClusterCount
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;2&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;5770&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;3&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      0.9995&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      0.998818&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;5416&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;4&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      0.995167
    </td>
    <td align="left" valign="top">
      0.988411&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;4767&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;5&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.9385&nbsp;
    </td>
    <td align="left" valign="top">
      0.877167&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;3032&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;6&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      0.759333
    </td>
    <td align="left" valign="top">
      0.516909&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;1178&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;8&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      0.150667
    </td>
    <td align="left" valign="top">
      0.0041183
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;29&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;10&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      0.115333
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;0&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;12&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      0.109667
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;0&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;15&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.118&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;0&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;18&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      0.113333
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;0&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;22&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.113&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;0&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;27&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      0.115833
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;0&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;33&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      0.109833
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;0&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;40&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.113&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;0&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;48&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      0.111167
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;0&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;58&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.1105&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;0&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;70&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      0.114667
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;0&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;84&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      0.114167
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;0&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
</table>


<a id="org8352cfb"></a>

# DBSCAN


<a id="org2c1e609"></a>

## How does it work?

There are two parameters in this algorithm, epsilon and min-samples. epsilon is the maximum distance from a cluster center and min sample is the minimum number of points required for a cluster to form. After cluster creation each point in every cluster starts its own circle and starts looking for other points to form a cluster.

As functions and what they do is really similar to what we already had, I&rsquo;ll only explain things that differ.
