unsupervised_learning/documentation.org
** Result
I couldn't find a meaningful relation between variables, but a simple explanation is that when min_samples is equal to 1 the algorithm creates a cluster for each data point. Another explanation is that for big epsilons the algorithm puts almost every point in a single cluster.
Here is a table showing results:

+-------+-----------+--------+------------+------------+
|epsilon|min_samples| AP     | RI         |ClusterCount|
+-------+-----------+--------+------------+------------+
|   1   |     1     |  1     |  1         |    6000    |
+-------+-----------+--------+------------+------------+
|   1   |     2     |0.112   |  0         |     1      |
+-------+-----------+--------+------------+------------+
|   1   |     3     |0.1125  |  0         |     1      |
+-------+-----------+--------+------------+------------+
|   1   |     4     |0.113   |  0         |     1      |
+-------+-----------+--------+------------+------------+
|   1   |     5     |0.110333|  0         |     1      |
+-------+-----------+--------+------------+------------+
|   1   |     6     |0.115333|  0         |     1      |
+-------+-----------+--------+------------+------------+
|   1   |     8     |0.106333|  0         |     1      |
+-------+-----------+--------+------------+------------+
|   1   |    10     |0.116667|  0         |     1      |
+-------+-----------+--------+------------+------------+
|   1   |    12     |0.110167|  0         |     1      |
+-------+-----------+--------+------------+------------+
|   1   |    15     |0.113333|  0         |     1      |
+-------+-----------+--------+------------+------------+
|   1   |    18     |0.116667|  0         |     1      |
+-------+-----------+--------+------------+------------+
|   1   |    22     | 0.114  |  0         |     1      |
+-------+-----------+--------+------------+------------+
|   1   |    27     |0.108167|  0         |     1      |
+-------+-----------+--------+------------+------------+
|   1   |    33     |0.108167|  0         |     1      |
+-------+-----------+--------+------------+------------+
|   1   |    40     | 0.1125 |  0         |     1      |
+-------+-----------+--------+------------+------------+
|   1   |    48     |0.108833|  0         |     1      |
+-------+-----------+--------+------------+------------+
|   2   |     1     |   1    |  1         |    6000    |
+-------+-----------+--------+------------+------------+
|   2   |     2     |0.111333|  0         |     1      |
+-------+-----------+--------+------------+------------+
|   2   |     3     |0.113667|  0         |     1      |
+-------+-----------+--------+------------+------------+
|   2   |     4     |0.111667|  0         |     1      |
+-------+-----------+--------+------------+------------+
|   2   |     5     | 0.1065 |  0         |     1      |
+-------+-----------+--------+------------+------------+
|   2   |     6     | 0.114  |  0         |     1      |
+-------+-----------+--------+------------+------------+
|   2   |     8     | 0.1085 |  0         |     1      |
+-------+-----------+--------+------------+------------+
|   2   |    10     | 0.1065 |  0         |     1      |
+-------+-----------+--------+------------+------------+
|   2   |    12     |0.115667|  0         |     1      |
+-------+-----------+--------+------------+------------+
|   2   |    15     | 0.1115 |  0         |     1      |
+-------+-----------+--------+------------+------------+
|   2   |    18     |0.111667|  0         |     1      |
+-------+-----------+--------+------------+------------+
|   2   |    22     |0.113333|  0         |     1      |
+-------+-----------+--------+------------+------------+
|   2   |    27     |0.109833|  0         |     1      |
+-------+-----------+--------+------------+------------+
|   2   |    33     |0.108667|  0         |     1      |
+-------+-----------+--------+------------+------------+
|   2   |    40     |0.113833|  0         |     1      |
+-------+-----------+--------+------------+------------+
|   2   |    48     |0.110167|  0         |     1      |
+-------+-----------+--------+------------+------------+
|   3   |     1     |   1    |  1         |    5995    |
+-------+-----------+--------+------------+------------+
|   3   |     2     | 0.114  |  0         |     2      |
+-------+-----------+--------+------------+------------+
|   3   |     3     |0.108667|  0         |     1      |
+-------+-----------+--------+------------+------------+
|   3   |     4     |0.116667|  0         |     1      |
+-------+-----------+--------+------------+------------+
|   3   |     5     | 0.112  |  0         |     1      |
+-------+-----------+--------+------------+------------+
|   3   |     6     |0.117667|  0         |     1      |
+-------+-----------+--------+------------+------------+
|   3   |     8     | 0.116  |  0         |     1      |
+-------+-----------+--------+------------+------------+
|   3   |    10     | 0.1165 |  0         |     1      |
+-------+-----------+--------+------------+------------+
|   3   |    12     |0.107167|  0         |     1      |
+-------+-----------+--------+------------+------------+
|   3   |    15     | 0.112  |  0         |     1      |
+-------+-----------+--------+------------+------------+
|   3   |    18     |0.113667|  0         |     1      |
+-------+-----------+--------+------------+------------+
|   3   |    22     |0.113333|  0         |     1      |
+-------+-----------+--------+------------+------------+
|   3   |    27     |0.110333|  0         |     1      |
+-------+-----------+--------+------------+------------+
|   3   |    33     |0.115667|  0         |     1      |
+-------+-----------+--------+------------+------------+
|   3   |    40     | 0.113  |  0         |     1      |
+-------+-----------+--------+------------+------------+
|   3   |    48     |0.108333|  0         |     1      |
+-------+-----------+--------+------------+------------+
|   4   |     1     |   1    |  1         |    5928    |
+-------+-----------+--------+------------+------------+
|   4   |     2     |0.118333|0.000126079 |     31     |
+-------+-----------+--------+------------+------------+
|   4   |     3     |0.115167|-0.000179338|     11     |
+-------+-----------+--------+------------+------------+
|   4   |     4     |0.114167|-9.28756e-05|     3      |
+-------+-----------+--------+------------+------------+
|   4   |     5     |0.114833|     0      |     3      |
+-------+-----------+--------+------------+------------+
|   4   |     6     |0.117833|     0      |     1      |
+-------+-----------+--------+------------+------------+
|   4   |     8     |0.113833|     0      |     1      |
+-------+-----------+--------+------------+------------+
|   4   |    10     |  0.12  |     0      |     1      |
+-------+-----------+--------+------------+------------+
|   4   |    12     |0.109167|     0      |     1      |
+-------+-----------+--------+------------+------------+
|   4   |    15     | 0.114  |     0      |     1      |
+-------+-----------+--------+------------+------------+
|   4   |    18     |0.113667|     0      |     1      |
+-------+-----------+--------+------------+------------+
|   4   |    22     |0.113667|     0      |     1      |
+-------+-----------+--------+------------+------------+
|   4   |    27     |0.108167|     0      |     1      |
+-------+-----------+--------+------------+------------+
|   4   |    33     |0.110833|     0      |     1      |
+-------+-----------+--------+------------+------------+
|   4   |    40     |0.110667|     0      |     1      |
+-------+-----------+--------+------------+------------+
|   4   |    48     |0.116833|     0      |     1      |
+-------+-----------+--------+------------+------------+
|   5   |     1     |   1    |     1      |    5747    |
+-------+-----------+--------+------------+------------+
|   5   |     2     | 0.1525 | 0.00715352 |     38     |
+-------+-----------+--------+------------+------------+
|   5   |     3     |0.145333| 0.00482054 |     18     |
+-------+-----------+--------+------------+------------+
|   5   |     4     |0.132833| 0.00174484 |     16     |
+-------+-----------+--------+------------+------------+
|   5   |     5     | 0.128  |0.000893047 |     11     |
+-------+-----------+--------+------------+------------+
|   5   |     6     |0.123333|3.99368e-06 |     9      |
+-------+-----------+--------+------------+------------+
|   5   |     8     | 0.121  |-0.000185251|     6      |
+-------+-----------+--------+------------+------------+
|   5   |    10     |0.114333|     0      |     2      |
+-------+-----------+--------+------------+------------+
|   5   |    12     |0.119833|     0      |     2      |
+-------+-----------+--------+------------+------------+
|   5   |    15     |0.116833|     0      |     1      |
+-------+-----------+--------+------------+------------+
|   5   |    18     |0.118167|     0      |     1      |
+-------+-----------+--------+------------+------------+
|   5   |    22     |0.108667|     0      |     1      |
+-------+-----------+--------+------------+------------+
|   5   |    27     | 0.113  |     0      |     1      |
+-------+-----------+--------+------------+------------+
|   5   |    33     | 0.114  |     0      |     1      |
+-------+-----------+--------+------------+------------+
|   5   |    40     |0.111667|     0      |     1      |
+-------+-----------+--------+------------+------------+
|   5   |    48     | 0.1075 |     0      |     1      |
+-------+-----------+--------+------------+------------+
|   6   |     1     |   1    |     1      |    5523    |
+-------+-----------+--------+------------+------------+
|   6   |     2     |0.184333|  0.020394  |     21     |
+-------+-----------+--------+------------+------------+
|   6   |     3     |0.171833| 0.0164176  |     8      |
+-------+-----------+--------+------------+------------+
|   6   |     4     |0.171667| 0.0145337  |     7      |
+-------+-----------+--------+------------+------------+
|   6   |     5     | 0.171  | 0.0133903  |     4      |
+-------+-----------+--------+------------+------------+
|   6   |     6     | 0.1585 | 0.00887019 |     2      |
+-------+-----------+--------+------------+------------+
|   6   |     8     |0.151667| 0.00730897 |     2      |
+-------+-----------+--------+------------+------------+
|   6   |    10     |0.156333| 0.00624232 |     2      |
+-------+-----------+--------+------------+------------+
|   6   |    12     |0.147667| 0.00478028 |     2      |
+-------+-----------+--------+------------+------------+
|   6   |    15     |  0.12  |0.000209748 |     4      |
+-------+-----------+--------+------------+------------+
|   6   |    18     | 0.1275 |0.000406582 |     4      |
+-------+-----------+--------+------------+------------+
|   6   |    22     |0.111667|     0      |     1      |
+-------+-----------+--------+------------+------------+
|   6   |    27     | 0.112  |     0      |     1      |
+-------+-----------+--------+------------+------------+
|   6   |    33     |0.107667|     0      |     1      |
+-------+-----------+--------+------------+------------+
|   6   |    40     | 0.1175 |     0      |     1      |
+-------+-----------+--------+------------+------------+
|   6   |    48     |0.114167|     0      |     1      |
+-------+-----------+--------+------------+------------+
|   8   |     1     |0.999667|   0.9992   |    5404    |
+-------+-----------+--------+------------+------------+
|   8   |     2     |0.217167| 0.0413145  |     28     |
+-------+-----------+--------+------------+------------+
|   8   |     3     |0.205333| 0.0374995  |     3      |
+-------+-----------+--------+------------+------------+
|   8   |     4     |0.201667| 0.0353645  |     4      |
+-------+-----------+--------+------------+------------+
|   8   |     5     | 0.1965 | 0.0338591  |     2      |
+-------+-----------+--------+------------+------------+
|   8   |     6     |0.200333| 0.0334593  |     2      |
+-------+-----------+--------+------------+------------+
|   8   |     8     |0.198833| 0.0328506  |     2      |
+-------+-----------+--------+------------+------------+
|   8   |    10     |0.196667| 0.0316348  |     2      |
+-------+-----------+--------+------------+------------+
|   8   |    12     | 0.1915 | 0.0311473  |     2      |
+-------+-----------+--------+------------+------------+
|   8   |    15     | 0.1965 | 0.0309658  |     2      |
+-------+-----------+--------+------------+------------+
|   8   |    18     |0.188833| 0.0283931  |     2      |
+-------+-----------+--------+------------+------------+
|   8   |    22     |0.185667| 0.0233562  |     2      |
+-------+-----------+--------+------------+------------+
|   8   |    27     | 0.189  | 0.0249011  |     2      |
+-------+-----------+--------+------------+------------+
|   8   |    33     | 0.187  | 0.0206931  |     2      |
+-------+-----------+--------+------------+------------+
|   8   |    40     | 0.185  | 0.0177916  |     2      |
+-------+-----------+--------+------------+------------+
|   8   |    48     |0.164167| 0.0127053  |     2      |
+-------+-----------+--------+------------+------------+
|  10   |     1     | 0.9985 |  0.996546  |    5151    |
+-------+-----------+--------+------------+------------+
|  10   |     2     |0.258667| 0.0480627  |    118     |
+-------+-----------+--------+------------+------------+
|  10   |     3     |0.233167| 0.0458787  |     26     |
+-------+-----------+--------+------------+------------+
|  10   |     4     |0.217667| 0.0430279  |     11     |
+-------+-----------+--------+------------+------------+
|  10   |     5     |0.209333| 0.0420634  |     8      |
+-------+-----------+--------+------------+------------+
|  10   |     6     |0.205333| 0.0423173  |     3      |
+-------+-----------+--------+------------+------------+
|  10   |     8     |0.204667| 0.0427908  |     2      |
+-------+-----------+--------+------------+------------+
|  10   |    10     |0.212167| 0.0454559  |     2      |
+-------+-----------+--------+------------+------------+
|  10   |    12     | 0.207  | 0.0425168  |     2      |
+-------+-----------+--------+------------+------------+
|  10   |    15     |0.208333| 0.0422536  |     2      |
+-------+-----------+--------+------------+------------+
|  10   |    18     |0.208667| 0.0443901  |     2      |
+-------+-----------+--------+------------+------------+
|  10   |    22     | 0.205  | 0.0386904  |     2      |
+-------+-----------+--------+------------+------------+
|  10   |    27     |0.205167| 0.0407945  |     2      |
+-------+-----------+--------+------------+------------+
|  10   |    33     | 0.2005 | 0.0386994  |     2      |
+-------+-----------+--------+------------+------------+
|  10   |    40     |0.205667| 0.0396743  |     2      |
+-------+-----------+--------+------------+------------+
|  10   |    48     | 0.203  | 0.0379674  |     2      |
+-------+-----------+--------+------------+------------+
|  12   |     1     | 0.898  |  0.760749  |    4395    |
+-------+-----------+--------+------------+------------+
|  12   |     2     | 0.296  | 0.0646981  |    169     |
+-------+-----------+--------+------------+------------+
|  12   |     3     |0.261667| 0.0610819  |     65     |
+-------+-----------+--------+------------+------------+
|  12   |     4     |0.241667| 0.0546563  |     21     |
+-------+-----------+--------+------------+------------+
|  12   |     5     |0.224333| 0.0505364  |     18     |
+-------+-----------+--------+------------+------------+
|  12   |     6     |0.223333| 0.0504102  |     14     |
+-------+-----------+--------+------------+------------+
|  12   |     8     |0.224167| 0.0473934  |     11     |
+-------+-----------+--------+------------+------------+
|  12   |    10     |0.212667| 0.0458124  |     4      |
+-------+-----------+--------+------------+------------+
|  12   |    12     | 0.214  | 0.0449376  |     4      |
+-------+-----------+--------+------------+------------+
|  12   |    15     | 0.2145 |  0.045794  |     3      |
+-------+-----------+--------+------------+------------+
|  12   |    18     |0.218167|  0.046506  |     4      |
+-------+-----------+--------+------------+------------+
|  12   |    22     | 0.2115 |  0.045121  |     3      |
+-------+-----------+--------+------------+------------+
|  12   |    27     |0.212833| 0.0481875  |     2      |
+-------+-----------+--------+------------+------------+
|  12   |    33     |0.206333| 0.0452869  |     2      |
+-------+-----------+--------+------------+------------+
|  12   |    40     |0.211667| 0.0455116  |     2      |
+-------+-----------+--------+------------+------------+
|  12   |    48     |0.212667| 0.0458467  |     2      |
+-------+-----------+--------+------------+------------+
|  15   |     1     | 0.615  |  0.219514  |    2852    |
+-------+-----------+--------+------------+------------+
|  15   |     2     |0.237167| 0.0463517  |    114     |
+-------+-----------+--------+------------+------------+
|  15   |     3     |0.215167| 0.0518122  |     32     |
+-------+-----------+--------+------------+------------+
|  15   |     4     |0.219667| 0.0566393  |     18     |
+-------+-----------+--------+------------+------------+
|  15   |     5     |0.208333| 0.0494388  |     6      |
+-------+-----------+--------+------------+------------+
|  15   |     6     |0.211333|  0.05032   |     8      |
+-------+-----------+--------+------------+------------+
|  15   |     8     | 0.2115 | 0.0531746  |     5      |
+-------+-----------+--------+------------+------------+
|  15   |    10     |0.209167| 0.0570896  |     4      |
+-------+-----------+--------+------------+------------+
|  15   |    12     | 0.217  | 0.0584442  |     6      |
+-------+-----------+--------+------------+------------+
|  15   |    15     | 0.2255 | 0.0661595  |     3      |
+-------+-----------+--------+------------+------------+
|  15   |    18     |0.228833| 0.0678252  |     3      |
+-------+-----------+--------+------------+------------+
|  15   |    22     |0.230833| 0.0641389  |     4      |
+-------+-----------+--------+------------+------------+
|  15   |    27     |0.210833| 0.0634284  |     3      |
+-------+-----------+--------+------------+------------+
|  15   |    33     |0.215833| 0.0649979  |     3      |
+-------+-----------+--------+------------+------------+
|  15   |    40     |0.207167| 0.0589075  |     2      |
+-------+-----------+--------+------------+------------+
|  15   |    48     |0.214167| 0.0620427  |     2      |
+-------+-----------+--------+------------+------------+
|  18   |     1     | 0.4155 | 0.0627408  |    1707    |
+-------+-----------+--------+------------+------------+
|  18   |     2     |0.204833| 0.0245047  |     77     |
+-------+-----------+--------+------------+------------+
|  18   |     3     |0.198833| 0.0246167  |     29     |
+-------+-----------+--------+------------+------------+
|  18   |     4     |0.190833| 0.0259082  |     12     |
+-------+-----------+--------+------------+------------+
|  18   |     5     |0.197833| 0.0297552  |     9      |
+-------+-----------+--------+------------+------------+
|  18   |     6     |0.186833| 0.0262412  |     4      |
+-------+-----------+--------+------------+------------+
|  18   |     8     | 0.189  | 0.0309404  |     3      |
+-------+-----------+--------+------------+------------+
|  18   |    10     |0.186667| 0.0296304  |     2      |
+-------+-----------+--------+------------+------------+
|  18   |    12     |0.191667| 0.0315301  |     2      |
+-------+-----------+--------+------------+------------+
|  18   |    15     |0.195333| 0.0373923  |     3      |
+-------+-----------+--------+------------+------------+
|  18   |    18     |0.192833| 0.0344452  |     2      |
+-------+-----------+--------+------------+------------+
|  18   |    22     | 0.1975 | 0.0371928  |     2      |
+-------+-----------+--------+------------+------------+
|  18   |    27     |0.191333| 0.0373274  |     2      |
+-------+-----------+--------+------------+------------+
|  18   |    33     |0.196333| 0.0417768  |     2      |
+-------+-----------+--------+------------+------------+
|  18   |    40     |0.194833| 0.0389586  |     2      |
+-------+-----------+--------+------------+------------+
|  18   |    48     |0.187167| 0.0434923  |     2      |
+-------+-----------+--------+------------+------------+
|  22   |     1     | 0.2495 |  0.011196  |    762     |
+-------+-----------+--------+------------+------------+
|  22   |     2     |0.161333| 0.00496978 |     48     |
+-------+-----------+--------+------------+------------+
|  22   |     3     |0.160333| 0.00843873 |     9      |
+-------+-----------+--------+------------+------------+
|  22   |     4     |0.152667| 0.00601804 |     7      |
+-------+-----------+--------+------------+------------+
|  22   |     5     |0.156167| 0.00794966 |     3      |
+-------+-----------+--------+------------+------------+
|  22   |     6     |0.142167| 0.00646844 |     3      |
+-------+-----------+--------+------------+------------+
|  22   |     8     |0.154833| 0.00835903 |     2      |
+-------+-----------+--------+------------+------------+
|  22   |    10     | 0.164  | 0.0108385  |     2      |
+-------+-----------+--------+------------+------------+
|  22   |    12     |0.170167| 0.0110854  |     2      |
+-------+-----------+--------+------------+------------+
|  22   |    15     |0.160333| 0.0119862  |     2      |
+-------+-----------+--------+------------+------------+
|  22   |    18     | 0.1645 | 0.0104256  |     2      |
+-------+-----------+--------+------------+------------+
|  22   |    22     |0.171333| 0.0117579  |     3      |
+-------+-----------+--------+------------+------------+
|  22   |    27     |0.166333|  0.013779  |     2      |
+-------+-----------+--------+------------+------------+
|  22   |    33     |0.158667| 0.0123178  |     2      |
+-------+-----------+--------+------------+------------+
|  22   |    40     |0.163833| 0.0114593  |     2      |
+-------+-----------+--------+------------+------------+
|  22   |    48     |0.166333| 0.0145922  |     2      |
+-------+-----------+--------+------------+------------+
|  27   |     1     |0.185333| 0.00370312 |    377     |
+-------+-----------+--------+------------+------------+
|  27   |     2     |0.130667|0.000727253 |     35     |
+-------+-----------+--------+------------+------------+
|  27   |     3     |0.135167| 0.00135523 |     14     |
+-------+-----------+--------+------------+------------+
|  27   |     4     | 0.126  | 0.00114075 |     2      |
+-------+-----------+--------+------------+------------+
|  27   |     5     |0.123167| 0.00121083 |     2      |
+-------+-----------+--------+------------+------------+
|  27   |     6     |0.125833| 0.0013828  |     3      |
+-------+-----------+--------+------------+------------+
|  27   |     8     |0.124333|0.000616473 |     2      |
+-------+-----------+--------+------------+------------+
|  27   |    10     |0.129167| 0.00195021 |     2      |
+-------+-----------+--------+------------+------------+
|  27   |    12     | 0.122  |0.000648059 |     2      |
+-------+-----------+--------+------------+------------+
|  27   |    15     |0.123333| 0.00132483 |     2      |
+-------+-----------+--------+------------+------------+
|  27   |    18     |0.135333| 0.00251873 |     2      |
+-------+-----------+--------+------------+------------+
|  27   |    22     |0.132167| 0.00173575 |     2      |
+-------+-----------+--------+------------+------------+
|  27   |    27     | 0.1275 | 0.00182336 |     2      |
+-------+-----------+--------+------------+------------+
|  27   |    33     | 0.1325 | 0.00197115 |     2      |
+-------+-----------+--------+------------+------------+
|  27   |    40     |0.137833| 0.00263512 |     2      |
+-------+-----------+--------+------------+------------+
|  27   |    48     | 0.1275 | 0.00249718 |     2      |
+-------+-----------+--------+------------+------------+
|  33   |     1     | 0.138  |0.000563966 |    160     |
+-------+-----------+--------+------------+------------+
|  33   |     2     |0.127667|0.000388157 |     18     |
+-------+-----------+--------+------------+------------+
|  33   |     3     |0.121833|5.94815e-05 |     11     |
+-------+-----------+--------+------------+------------+
|  33   |     4     |0.119667|0.000236978 |     5      |
+-------+-----------+--------+------------+------------+
|  33   |     5     |0.117333|0.000256806 |     2      |
+-------+-----------+--------+------------+------------+
|  33   |     6     | 0.1155 |8.42259e-05 |     2      |
+-------+-----------+--------+------------+------------+
|  33   |     8     |0.126167|0.000796342 |     2      |
+-------+-----------+--------+------------+------------+
|  33   |    10     |0.123167|0.000388536 |     2      |
+-------+-----------+--------+------------+------------+
|  33   |    12     | 0.119  |0.000463346 |     2      |
+-------+-----------+--------+------------+------------+
|  33   |    15     |0.119667|0.000533426 |     2      |
+-------+-----------+--------+------------+------------+
|  33   |    18     |  0.12  |0.000399171 |     2      |
+-------+-----------+--------+------------+------------+
|  33   |    22     | 0.121  |0.000251038 |     2      |
+-------+-----------+--------+------------+------------+
|  33   |    27     |0.122667|0.000521123 |     2      |
+-------+-----------+--------+------------+------------+
|  33   |    33     |0.122167|0.000507524 |     2      |
+-------+-----------+--------+------------+------------+
|  33   |    40     | 0.1205 |0.000342103 |     2      |
+-------+-----------+--------+------------+------------+
|  33   |    48     |0.116167|0.000692975 |     2      |
+-------+-----------+--------+------------+------------+
|  40   |     1     |0.128833|0.000189544 |     89     |
+-------+-----------+--------+------------+------------+
|  40   |     2     |0.122667|9.79239e-05 |     15     |
+-------+-----------+--------+------------+------------+
|  40   |     3     |0.112833|0.000152592 |     3      |
+-------+-----------+--------+------------+------------+
|  40   |     4     |0.113667|0.000122208 |     2      |
+-------+-----------+--------+------------+------------+
|  40   |     5     |  0.11  |1.29211e-05 |     2      |
+-------+-----------+--------+------------+------------+
|  40   |     6     |0.117833|0.000120968 |     2      |
+-------+-----------+--------+------------+------------+
|  40   |     8     |0.110833|1.85982e-05 |     2      |
+-------+-----------+--------+------------+------------+
|  40   |    10     |0.115833|0.000290297 |     2      |
+-------+-----------+--------+------------+------------+
|  40   |    12     | 0.1185 |0.000155974 |     2      |
+-------+-----------+--------+------------+------------+
|  40   |    15     |0.118667| 9.0435e-05 |     2      |
+-------+-----------+--------+------------+------------+
|  40   |    18     | 0.127  | 7.1668e-05 |     2      |
+-------+-----------+--------+------------+------------+
|  40   |    22     |0.120667| 8.5268e-05 |     2      |
+-------+-----------+--------+------------+------------+
|  40   |    27     |0.112167|0.000103917 |     2      |
+-------+-----------+--------+------------+------------+
|  40   |    33     | 0.1225 |7.65653e-05 |     2      |
+-------+-----------+--------+------------+------------+
|  40   |    40     |0.117833|9.48118e-05 |     2      |
+-------+-----------+--------+------------+------------+
|  40   |    48     | 0.1205 |5.93216e-05 |     2      |
+-------+-----------+--------+------------+------------+
|  48   |     1     |0.127167|0.000153136 |     63     |
+-------+-----------+--------+------------+------------+
|  48   |     2     | 0.1145 |4.45421e-05 |     9      |
+-------+-----------+--------+------------+------------+
|  48   |     3     |0.113667|-9.01441e-06|     2      |
+-------+-----------+--------+------------+------------+
|  48   |     4     |0.116167|7.09657e-05 |     2      |
+-------+-----------+--------+------------+------------+
|  48   |     5     |0.120667|0.000178664 |     2      |
+-------+-----------+--------+------------+------------+
|  48   |     6     |0.119333|5.50319e-05 |     2      |
+-------+-----------+--------+------------+------------+
|  48   |     8     | 0.1095 |-4.89426e-05|     2      |
+-------+-----------+--------+------------+------------+
|  48   |    10     |0.119333|2.36379e-05 |     2      |
+-------+-----------+--------+------------+------------+
|  48   |    12     |0.119167|4.37861e-05 |     2      |
+-------+-----------+--------+------------+------------+
|  48   |    15     | 0.115  |4.41703e-05 |     2      |
+-------+-----------+--------+------------+------------+
|  48   |    18     | 0.1115 |-4.02694e-05|     2      |
+-------+-----------+--------+------------+------------+
|  48   |    22     |0.113333|7.52591e-05 |     2      |
+-------+-----------+--------+------------+------------+
|  48   |    27     |0.117833|0.000125597 |     2      |
+-------+-----------+--------+------------+------------+
|  48   |    33     |0.114167|-8.65388e-06|     2      |
+-------+-----------+--------+------------+------------+
|  48   |    40     | 0.1195 |3.94606e-05 |     2      |
+-------+-----------+--------+------------+------------+
|  48   |    48     | 0.118  |6.77043e-05 |     2      |
+-------+-----------+--------+------------+------------+
