unsupervised_learning/documentation.org
* Agglomerative
** How does it work?
This algorithm forms a tree and starts from the leaves. First of all it puts the most similar points in a cluster, then puts similar clusters in clusters and so on until we have one giant cluster! So we'll have a hierarchy as a result.
Also there isn't much to play with in this algorithm. Although we can provide number of clusters but results are clear and it's pointless, the more clusters we have the higher accuracy we'll get out of this algorithm. That's why I'll provide table for different linkages only.
** Libraries
#+BEGIN_SRC python
from sklearn.cluster import AgglomerativeClustering
from sklearn.metrics import accuracy_score, adjusted_rand_score
from tabulate import tabulate
from util import _x, _y_int
import math
import numpy as np
import random as rand
#+END_SRC
** Init functions and evaluation
It's almost identical to what we had in mentioned algorithms, so there isn't much to explain.
#+BEGIN_SRC python
clustering = None

def classify_clusters(l1, l2):
    ref_labels = {}
    for i in range(len(np.unique(l1))):
        index = np.where(l1 == i,1,0)
        temp = np.bincount(l2[index==1]).argmax()
        ref_labels[i] = temp
    decimal_labels = np.zeros(len(l1))
    for i in range(len(l1)):
        decimal_labels[i] = ref_labels[l1[i]]
    return decimal_labels

def init_clustring_scikit(linkage, slice_size=10000):
    global clustering
    indexes = np.random.choice(len(_x), size=slice_size, replace=False)
    clustering = AgglomerativeClustering(n_clusters=10, affinity="euclidean", compute_full_tree=True, linkage=linkage)
    clustering.fit(_x[indexes])
    return _y_int[indexes]

def test_accuracy_scikit(labels):
    global clustering
    decimal_labels = classify_clusters(clustering.labels_, labels)
    print("predicted labels:\t", decimal_labels[:16].astype('int'))
    print("true labels:\t\t", labels[:16])
    print(60 * '_')
    AP = accuracy_score(decimal_labels,labels)
    RI = adjusted_rand_score(decimal_labels,labels)
    print("Accuracy (PURITY):" , AP)
    print("Accuracy (RAND INDEX):" , RI)
    return AP, RI

def pipeline(linkage=["ward", "single", "average", "complete"]):
    result = []
    AP = None
    RI = None
    for x in linkage:
        print(10 * "*" + "TRYING WITH " + x + 10 * "*")
        labels = init_clustring_scikit(x)
        AP, RI = test_accuracy_scikit(labels)
        result.append([x, AP, RI])
    print(tabulate(result, headers=['linkage', 'AP', 'RI']))
#+END_SRC

#+RESULTS:
: None

** Result
This table is really self explanatory, ward has the best score and single has the worst score.

+--------+------+----------+
|linkage | AP   | RI       |
+--------+------+----------+
| ward   |0.6321|0.471757  |
+--------+------+----------+
|single  |0.1113|1.2206e-05|
+--------+------+----------+
|average |0.2045|0.0420506 |
+--------+------+----------+
|complete|0.3879| 0.204411 |
+--------+------+----------+
