unsupervised_learning/documentation.md


<a id="org3aa15fb"></a>

# Agglomerative


<a id="orgdd1c239"></a>

## How does it work?

This algorithm forms a tree and starts from the leaves. First of all it puts the most similar points in a cluster, then puts similar clusters in clusters and so on until we have one giant cluster! So we&rsquo;ll have a hierarchy as a result.
Also there isn&rsquo;t much to play with in this algorithm. Although we can provide number of clusters but results are clear and it&rsquo;s pointless, the more clusters we have the higher accuracy we&rsquo;ll get out of this algorithm. That&rsquo;s why I&rsquo;ll provide table for different linkages only.


<a id="org86c6eef"></a>

## Libraries

    from sklearn.cluster import AgglomerativeClustering
    from sklearn.metrics import accuracy_score, adjusted_rand_score
    from tabulate import tabulate
    from util import _x, _y_int
    import math
    import numpy as np
    import random as rand


<a id="org3e61037"></a>

## Init functions and evaluation

It&rsquo;s almost identical to what we had in mentioned algorithms, so there isn&rsquo;t much to explain.

    clustering = None
    
    def classify_clusters(l1, l2):
        ref_labels = {}
        for i in range(len(np.unique(l1))):
            index = np.where(l1 == i,1,0)
            temp = np.bincount(l2[index==1]).argmax()
            ref_labels[i] = temp
        decimal_labels = np.zeros(len(l1))
        for i in range(len(l1)):
            decimal_labels[i] = ref_labels[l1[i]]
        return decimal_labels
    
    def init_clustring_scikit(linkage, slice_size=10000):
        global clustering
        indexes = np.random.choice(len(_x), size=slice_size, replace=False)
        clustering = AgglomerativeClustering(n_clusters=10, affinity="euclidean", compute_full_tree=True, linkage=linkage)
        clustering.fit(_x[indexes])
        return _y_int[indexes]
    
    def test_accuracy_scikit(labels):
        global clustering
        decimal_labels = classify_clusters(clustering.labels_, labels)
        print("predicted labels:\t", decimal_labels[:16].astype('int'))
        print("true labels:\t\t", labels[:16])
        print(60 * '_')
        AP = accuracy_score(decimal_labels,labels)
        RI = adjusted_rand_score(decimal_labels,labels)
        print("Accuracy (PURITY):" , AP)
        print("Accuracy (RAND INDEX):" , RI)
        return AP, RI
    
    def pipeline(linkage=["ward", "single", "average", "complete"]):
        result = []
        AP = None
        RI = None
        for x in linkage:
            print(10 * "*" + "TRYING WITH " + x + 10 * "*")
            labels = init_clustring_scikit(x)
            AP, RI = test_accuracy_scikit(labels)
            result.append([x, AP, RI])
        print(tabulate(result, headers=['linkage', 'AP', 'RI']))


<a id="orgbb92b23"></a>

## Result

This table is really self explanatory, ward has the best score and single has the worst score.

<!-- This HTML table template is generated by emacs 27.2 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      linkage&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;AP&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;RI&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;ward&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      0.6321
    </td>
    <td align="left" valign="top">
      0.471757&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      single&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      0.1113
    </td>
    <td align="left" valign="top">
      1.2206e-05
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      average&nbsp;
    </td>
    <td align="left" valign="top">
      0.2045
    </td>
    <td align="left" valign="top">
      0.0420506&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      complete
    </td>
    <td align="left" valign="top">
      0.3879
    </td>
    <td align="left" valign="top">
      &nbsp;0.204411&nbsp;
    </td>
  </tr>
</table>

